10/data/attachments/ba0d4c595a2fcfe0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_no_Friend_26611_3</nif:username>
            <nif:friendToBeRequested>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>